/**
 * Created by admin on 26.11.2016.
 */
package ru.szhernovoy;

/*
1. Создать модель User c полями name, login, email, createDate.
2. Необходимо создать сервлет UsersServlet и определить там методы do Get Post Put Delete.
3. Каждый метод сервлета должен выполнять только одно действие -
создать пользователя, редактировать, получить. Удалить.
4. Для хранения данных использовать базу данных Postgresql.
То есть при старте сервлета вам нужно создать коннект в базе данных и записывать туда данные.
 */