/**
 * Created by szhernovoy on 08.10.2016.
 */
package ru.szhernovoy.treads1;

//*********************************************************************
//**** Задание на разработку
//*********************************************************************

//**** первая задача по нитям
//
//1.Создать программу, которая будет считать количество и пробелом в тексте.
//2. Необходимо создать два Thread. Первый будет считать количество слов. Второй количество пробелом в тексте.
//3. Вывести результат на экран.
